In [32]:
import scipy.stats as stats
import statsmodels.api as sm
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import chi2_contingency
import warnings
warnings.filterwarnings("ignore")

# QUESTION 1

### 1) Importing Files

In [2]:
cutlets = pd.read_csv("Cutlets.csv")
cutlets.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

### 2) Applying Descriptive Stats

In [3]:
cutlets.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

### 3) Checking the Data Type

In [4]:
cutlets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

### 4) Checking for Null Value and Duplicate Values

In [5]:
cutlets.isnull().sum()

Unit A    0
Unit B    0
dtype: int64

In [6]:
cutlets.shape

(35, 2)

In [7]:
cutlets.duplicated().sum()

0

### 5) Applying t-stats

In [8]:
p_value1 = stats.ttest_ind(cutlets['Unit A'],cutlets['Unit B'])

In [9]:
p_value1

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [10]:
# p-value1 is not equal to aplha which is equal to 0.025, hence we fail to reject null hypothesis

#### ANS:There are no significant differences between the Unit A and Unit B

# Question 2

### 1) Importing Files

In [11]:
labtat = pd.read_csv('labTAT.csv')

In [12]:
labtat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

### 2) Applying Descriptive Stats

In [13]:
labtat.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

### 3) Checking the Data Type

In [14]:
labtat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

### 4) Checking for Null Values and Duplicate Values

In [15]:
labtat.shape

(120, 4)

In [16]:
labtat.duplicated().sum()

0

In [17]:
labtat.isnull().sum()

Laboratory 1    0
Laboratory 2    0
Laboratory 3    0
Laboratory 4    0
dtype: int64

### 5) Applying t-stats

In [21]:
p_value2=stats.f_oneway(labtat['Laboratory 1'],labtat['Laboratory 2'],labtat['Laboratory 3'],labtat['Laboratory 4'])

In [22]:
p_value2

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [23]:
# p-value2 is not equal to aplha which is equal to 0.05, hence we fail to reject null hypothesis

#### ANS: There is no significant difference between samples of Labratories

# Question 3

### 1) Importing Files

In [24]:
buyer = pd.read_csv('BuyerRatio.csv')

In [25]:
buyer.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

### 2) Creating Contingency Table

In [29]:
values= [[50,142,131,70],
        [435,1523,1356,750]] #Contingency table

In [30]:
values

[[50, 142, 131, 70], [435, 1523, 1356, 750]]

### 3) Calculating Expected Values

In [33]:
chi2_contingency(values)

Chi2ContingencyResult(statistic=1.595945538661058, pvalue=0.6603094907091882, dof=3, expected_freq=array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
       [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [34]:
# p-value is not equal to aplha which is equal to 0.05, hence we fail to reject null hypothesis

#### ANS: We Fail to reject Null Hypothesis, They are independent samples.

# Question 4

### 1) Importing File

In [37]:
df = pd.read_csv("Costomer+OrderForm.csv")

In [38]:
df.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

### 2) Applying Descriptive Stats

In [41]:
df.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

### 3) Checking the Data Type

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

### 4) Checking for Null Value

In [46]:
df.shape

(300, 4)

In [47]:
df.isnull().sum()

Phillippines    0
Indonesia       0
Malta           0
India           0
dtype: int64

### 5) Checking Value Counts

In [51]:
df.Phillippines.value_counts(),df.Indonesia.value_counts(),df.Malta.value_counts(),df.India.value_counts()

(Error Free    271
 Defective      29
 Name: Phillippines, dtype: int64,
 Error Free    267
 Defective      33
 Name: Indonesia, dtype: int64,
 Error Free    269
 Defective      31
 Name: Malta, dtype: int64,
 Error Free    280
 Defective      20
 Name: India, dtype: int64)

### 6) Creating Contingency Table

In [52]:
values2 = [[271,267,269,280],
                    [29,33,31,20]]

In [53]:
values2

[[271, 267, 269, 280], [29, 33, 31, 20]]

### 7) Calculating Expected Values

In [55]:
chi2_contingency(values2)

Chi2ContingencyResult(statistic=3.858960685820355, pvalue=0.2771020991233135, dof=3, expected_freq=array([[271.75, 271.75, 271.75, 271.75],
       [ 28.25,  28.25,  28.25,  28.25]]))

In [ ]:
# p-value is not equal to aplha which is equal to 0.05, hence we fail to reject null hypothesis